Revit 2027 API
CeramicApplicationType Enumeration
 The enumerated type representing the permitted values for the asset property "CeramicApplication" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CeramicApplicationType
Public Enumeration CeramicApplicationType
public enum class CeramicApplicationType
type CeramicApplicationType
Members
Member name | Value | Description
HighGlossy | 0
Matte | 2
Satin | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace